Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/edc/PIC32CM1216LS00048.PIC
      <edc:SFRDef edc:_addr="0x40003033" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003034" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX4" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003035" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003036" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX6" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003037" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003038" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX8" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003039" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX9" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="I" edc:desc="Peripheral function I selected" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="J" edc:desc="Peripheral function J selected" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="K" edc:desc="Peripheral function K selected" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
