Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/edc/PIC32CM1216LS00048.PIC
      <edc:SFRDef edc:_addr="0x420003E0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NONSECUSER0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:desc="Non-Secure for User 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:desc="Non-Secure for User 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:desc="Non-Secure for User 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:desc="Non-Secure for User 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:desc="Non-Secure for User 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:desc="Non-Secure for User 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:desc="Non-Secure for User 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:desc="Non-Secure for User 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:desc="Non-Secure for User 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:desc="Non-Secure for User 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:desc="Non-Secure for User 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:desc="Non-Secure for User 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:desc="Non-Secure for User 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:desc="Non-Secure for User 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:desc="Non-Secure for User 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:desc="Non-Secure for User 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:desc="Non-Secure for User 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:desc="Non-Secure for User 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:desc="Non-Secure for User 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:desc="Non-Secure for User 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:desc="Non-Secure for User 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:desc="Non-Secure for User 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:desc="Non-Secure for User 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER23" edc:desc="Non-Secure for User 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER24" edc:desc="Non-Secure for User 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER25" edc:desc="Non-Secure for User 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER26" edc:desc="Non-Secure for User 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER27" edc:desc="Non-Secure for User 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER28" edc:desc="Non-Secure for User 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER29" edc:desc="Non-Secure for User 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER30" edc:desc="Non-Secure for User 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER31" edc:desc="Non-Secure for User 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420003E4" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="NONSECUSER1" edc:impl="0xFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER32" edc:desc="Non-Secure for User 32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER33" edc:desc="Non-Secure for User 33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER34" edc:desc="Non-Secure for User 34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER35" edc:desc="Non-Secure for User 35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER36" edc:desc="Non-Secure for User 36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER37" edc:desc="Non-Secure for User 37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER38" edc:desc="Non-Secure for User 38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER39" edc:desc="Non-Secure for User 39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER40" edc:desc="Non-Secure for User 40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER41" edc:desc="Non-Secure for User 41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER42" edc:desc="Non-Secure for User 42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER43" edc:desc="Non-Secure for User 43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER44" edc:desc="Non-Secure for User 44" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER45" edc:desc="Non-Secure for User 45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER46" edc:desc="Non-Secure for User 46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER47" edc:desc="Non-Secure for User 47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER48" edc:desc="Non-Secure for User 48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER49" edc:desc="Non-Secure for User 49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER50" edc:desc="Non-Secure for User 50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER51" edc:desc="Non-Secure for User 51" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
