Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/edc/PIC32CM1216LS00048.PIC
      <edc:AdjustPoint edc:_addr="0xE0002FC0" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0xE0002FCC" edc:access="------------------------rrrrrrrr" edc:cname="FP_DEVTYPE" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:desc="Major type" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SUB" edc:desc="Sub-type" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FD0" edc:access="------------------------rrrrrrrr" edc:cname="FP_PIDR4" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="DES_2" edc:desc="JEP106 continuation code" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="4KB count" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FP_PIDR5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FPB"/>
      <edc:SFRDef edc:_addr="0xE0002FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FP_PIDR6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FPB"/>
      <edc:SFRDef edc:_addr="0xE0002FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FP_PIDR7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FPB"/>
      <edc:SFRDef edc:_addr="0xE0002FE0" edc:access="------------------------rrrrrrrr" edc:cname="FP_PIDR0" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="PART_0" edc:desc="Part number bits[7:0]" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FE4" edc:access="------------------------rrrrrrrr" edc:cname="FP_PIDR1" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="PART_1" edc:desc="Part number bits[11:8]" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DES_0" edc:desc="JEP106 identification code bits [3:0]" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FE8" edc:access="------------------------rrrrrrrr" edc:cname="FP_PIDR2" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="DES_1" edc:desc="JEP106 identification code bits[6:4]" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="JEDEC" edc:desc="JEDEC assignee value is used" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Component revision" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FEC" edc:access="------------------------rrrrrrrr" edc:cname="FP_PIDR3" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="CMOD" edc:desc="Customer Modified" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:desc="RevAnd" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FF0" edc:access="------------------------rrrrrrrr" edc:cname="FP_CIDR0" edc:impl="0xFF" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="PRMBL_0" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FF4" edc:access="------------------------rrrrrrrr" edc:cname="FP_CIDR1" edc:impl="0xFF" edc:mclr="00000000000000000000000010010000" edc:nzwidth="0x20" edc:por="00000000000000000000000010010000" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="PRMBL_1" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CLASS" edc:desc="CoreSight component class" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FF8" edc:access="------------------------rrrrrrrr" edc:cname="FP_CIDR2" edc:impl="0xFF" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="PRMBL_2" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FFC" edc:access="------------------------rrrrrrrr" edc:cname="FP_CIDR3" edc:impl="0xFF" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="PRMBL_3" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0003000" edc:offset="0xB004"/>
      <edc:SFRDef edc:_addr="0xE000E004" edc:access="----------------------------rrrr" edc:cname="ICTR" edc:desc="Interrupt Controller Type Register" edc:impl="0xF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTLINESNUM" edc:desc="Number of interrupt lines supported by NVIC in granularities of 32." edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
